<?php
//  <!-- 定义变量  ，  变量 可以去引用 一些数据 ，  变量可以被重新赋值
//   1、    语法 ：
//        $变量名  = "值" ；
//     
//     
//   2、只要定义了 变量 ， 那么再次使用这个变量的时候  一定要       $变量名  
//     
//   3、 =   代表赋值运算  ， 意思是把    = 后边的值，   赋值给 ，  = 前边的值 。
//        
//   4 、 php 是弱类型语言   那么在定义变量的时候     不需要定义一个变量的类型
//               
//        强类型语言     是用    类型 定义变量的    比如  int a  这个a 赋值的时候只能是  数值型 ，  
//        弱类型语言     是用    值来定义变量的类型    比如：  $a  = 12 ；  那么就是由 12 控制的 $a 的类型的   
//       
//    5 、 变量名的定义规范 
//       
//         1) 在创建 和使用的时候  必须 有  $ 
//          
//          2) 变量名不能以数字  开始 
//          
//          3) 变量名不能时使用  运算符     +  -  *  / %  &
//    
//          4） 变量名 可以使用   可以使用关键字 
//          
//          5） 一定要用英文或者拼音写， 见名知意  保持驼峰式    aaaBbbCcc
//          
//          6） 区分大小写
//         
//     6 /拼接：   拼接字符串    
//        "".变量 
//                 变量."" 
//                -->
                  
  

   
    $a = 1 ;
   // 把1 赋值给 一个变量a ; 
    
  $a + 1 ;
    
    echo  $a;




  

?>